# This is the default yosys script used to read from yosys to lgraph (yosys2lg)

#read_verilog -sv LIST
proc
pmuxtree
memory_dff
memory_collect
write_verilog foo.v
#alumacc
#techmap -map techmap.v
#abc
#maccmap -unmap
#write_verilog f4.v

